# 第五章：CO-RE、BTF 和 Libbpf

在上一章中，您首次遇到了 BTF（BPF 类型格式）。本章讨论了它存在的原因以及如何使用它使 eBPF 程序在不同内核版本间可移植。这是 BPF“编译一次，到处运行”（CO-RE）方法的关键部分，解决了在不同内核版本间实现 eBPF 程序可移植性的问题。

许多 eBPF 程序访问内核数据结构，eBPF 程序员需要包含相关的 Linux 头文件，以便他们的 eBPF 代码可以正确地定位这些数据结构中的字段。然而，Linux 内核在持续开发中，这意味着内部数据结构在不同内核版本间可能会发生变化。如果您将在一台机器上编译的 eBPF 对象文件加载到具有不同内核版本的机器上，不能保证数据结构会保持一致。

CO-RE 方法在有效解决这一可移植性问题方面迈出了重要的一步。它允许 eBPF 程序包含有关它们编译时所用数据结构布局的信息，并提供了一种机制，用于调整在目标机器上运行时数据结构布局不同情况下字段访问的方式。只要程序不需要访问目标机器内核中根本不存在的字段或数据结构，程序就能在不同内核版本间实现可移植性。

但在深入讨论 CO-RE 如何工作之前，让我们看看为什么它是如此令人向往的，通过观察最初在 BCC 项目中实现的内核可移植性的先前方法。

# BCC 对可移植性的方法

在第二章中，我使用[BCC](https://oreil.ly/ReUtn)展示了 eBPF 程序的基本“Hello World”示例。BCC 项目是第一个流行的用于实现 eBPF 程序的项目，为没有太多内核经验的程序员提供了一个相对易于使用的用户空间和内核方面的框架。为了解决跨内核的可移植性问题，BCC 采用了在目标机器上即时编译 eBPF 代码的方法。然而，这种方法存在一些问题：

+   编译工具链需要安装在每台希望运行代码的目标机器上，还需要内核头文件（这些文件通常不会默认存在）。

+   在工具启动之前，您必须等待编译完成，这可能意味着每次启动工具都会有几秒钟的延迟。

+   如果您在大量相同的机器群上运行工具，每台机器上都重复编译是一种计算资源的浪费。

+   一些基于 BCC 的项目将它们的 eBPF 源代码和工具链打包到一个容器映像中，这使得将其分发到每台机器更加容易。但这并不能解决确保内核头文件存在的问题，甚至可能意味着如果安装了多个这些 BCC 容器，则会有更多的重复。

+   嵌入式设备可能没有足够的内存资源来运行编译步骤。

因为这些问题，如果你计划开始开发一个重要的新 eBPF 项目，我不建议使用这种传统的 BCC 方法，尤其是如果你计划将其分发给其他人使用。在本书中，我给出了一些基于 BCC 的示例，因为它是了解 eBPF 基本概念的好方法，特别是因为 Python 用户空间代码如此紧凑且易于阅读。如果你更喜欢使用它，并且想要快速组装一些东西，那么它也是一个完全不错的选择。但是对于严肃的现代 eBPF 开发来说，它并不是最佳选择。

CO-RE 方法为 eBPF 程序的跨内核可移植性问题提供了一个更好的解决方案。

###### 注意

BCC 项目位于[*github.com/iovisor/bcc*](https://oreil.ly/ReUtn)，包含广泛的命令行工具，用于观察 Linux 机器行为的各种信息。位于[*tools*](https://oreil.ly/fI4w_)目录中的原始版本大多使用 Python 实现，使用了我在本节中描述的传统可移植性方法。

在 BCC 的[*libbpf-tools*](https://oreil.ly/ke7yq)目录中，你会找到使用 C 编写的更新版本的这些工具，利用了*libbpf*和 CO-RE，并且不会遇到我刚刚列出的问题。它们是一套非常有用的实用工具集！

# CO-RE 概述

CO-RE 方法由几个元素组成：^(2)^,^(3)

BTF

[BTF](https://oreil.ly/iRCuI) 是用于表示数据结构布局和函数签名的格式。在 CO-RE 中，它用于确定编译时和运行时使用的结构之间的任何差异。像`bpftool`这样的工具也使用 BTF 来以人类可读的格式转储数据结构。从 Linux 内核 5.4 版本开始支持 BTF。

内核头文件

Linux 内核源代码包括描述其使用的数据结构的头文件，这些头文件在不同版本的 Linux 之间可能会发生变化。eBPF 程序员可以选择包含单独的头文件，或者如本章所示，可以使用`bpftool`从运行中的系统生成一个名为*vmlinux.h*的头文件，其中包含 BPF 程序可能需要的有关内核的所有数据结构信息。

编译器支持

当 Clang 编译器使用 `-g` 标志编译带有 *CO-RE 重定位* 的 eBPF 程序时，它包含了从描述内核数据结构的 BTF 信息中导出的内容。GCC 编译器也在版本 12 中为 BPF 目标添加了 CO-RE 支持。

用于数据结构重定位的库支持

在用户空间程序将 eBPF 程序加载到内核时，CO-RE 方法要求调整字节码以补偿编译时存在的数据结构与目标机器上实际运行时的差异，这是基于编译到对象中的 CO-RE 重定位信息。有几个库可以处理这个问题：*libbpf* 是最初的 C 库，包含这种重定位能力；Cilium 的 eBPF 库为 Go 程序员提供了同样的功能；Aya 则为 Rust 提供了支持。

可选地，BPF 骨架

骨架可以从编译后的 BPF 对象文件自动生成，其中包含了方便用户空间代码调用的实用函数，用于管理 BPF 程序的生命周期——将它们加载到内核中，将它们附加到事件上等。如果您使用 C 编写用户空间代码，可以使用 `bpftool gen skeleton` 生成这些骨架。这些函数是比直接使用底层库（*libbpf*、*cilium/ebpf* 等）更方便的高级抽象。

###### 注意

Andrii Nakryiko 写了一篇关于 CO-RE 背景的[卓越博客文章](https://oreil.ly/aeQJo)，并详细介绍了其工作原理及如何使用。他还撰写了权威的[BPF CO-RE 参考指南](https://oreil.ly/lbW_T)，如果您准备自行编写代码，请务必阅读。他的 *libbpf-bootstrap* 指南则介绍了使用 CO-RE + *libbpf* + 骨架从头开始构建 eBPF 应用的方法，也是另一个必读资源。

现在您已经对 CO-RE 的元素有了概述，让我们深入了解它们的工作原理，从探索 BTF 开始。

# BPF 类型格式

BTF 信息描述了数据结构和代码在内存中的布局方式。这些信息可以用于各种不同的用途。

## BTF 使用案例

讨论 BTF 在本章关于 CO-RE 中的主要原因是，了解在编译 eBPF 程序的结构布局与将要运行的结构布局之间的差异，允许在程序加载到内核时进行适当的调整。我将在本章后面讨论重定位过程，但现在，让我们也考虑一些 BTF 信息可以用于的其他用途。

知道结构体的布局方式及其每个字段的类型，可以使结构体的内容以人类可读的形式进行漂亮打印。例如，从计算机的角度来看，字符串只是一系列字节，但将这些字节转换为字符可以使字符串更易于人类理解。您在前一章已经看到了一个例子，其中 `bpftool` 使用 BTF 信息来格式化映射转储的输出。

BTF 信息还包括行和函数信息，使 `bpftool` 能够在从翻译或 JIT 编译的程序转储的输出中插入源代码，正如您在 第三章 中看到的那样。当您阅读 第六章 时，您还将看到源代码信息与验证器日志输出交错，这同样来自于 BTF 信息。

BTF 信息还需要用于 BPF 自旋锁。*自旋锁* 用于阻止两个 CPU 核同时访问相同的映射值。锁必须是映射值结构体的一部分，如下所示：

```
struct my_value {
     ... <other fields>
     struct bpf_spin_lock lock;
... <other fields>
};
```

在内核内部，eBPF 程序使用 `bpf_spin_lock()` 和 `bpf_spin_unlock()` 辅助函数来获取和释放锁。只有在有可用的 BTF 信息描述锁字段所在位置时，才能使用这些辅助函数。

###### 注意

自旋锁支持是在内核版本 5.1 中添加的。对于自旋锁的使用有很多限制：它们只能用于哈希或数组映射类型，并且不能在跟踪或套接字过滤类型的 eBPF 程序中使用。更多关于自旋锁的信息，请参阅 [lwn.net 上有关 BPF 并发管理的文章](https://oreil.ly/kAyAU)。

现在您知道 BTF 信息的用处，让我们通过查看一些示例来更具体化。

## 使用 `bpftool` 列出 BTF 信息

与程序和地图一样，您可以使用 `bpftool` 实用程序显示 BTF 信息。以下命令列出加载到内核中的所有 BTF 数据：

```
bpftool btf list
1: name [vmlinux]  size 5843164B
2: name [aes_ce_cipher]  size 407B
3: name [cryptd]  size 3372B
...
149: name <anon>  size 4372B  prog_ids 319  map_ids 103
        pids hello-buffer-co(7660)
155: name <anon>  size 37100B
        pids bpftool(7784)
```

（为了简洁起见，我省略了结果中的许多条目。）

列表中的第一项是 `vmlinux`，它对应我之前提到的 *vmlinux* 文件，其中包含有关当前运行内核的 BTF 信息。

###### 注意

本章早期的一些示例重用了 第四章 的程序，然后在本章后期，您将找到新的示例，这些示例的源代码位于 [*github.com/lizrice/learning-ebpf*](https://github.com/lizrice/learning-ebpf) 的 *chapter5* 目录中。

要获取此示例输出，我在运行 第四章 的 `hello-buffer-config` 示例时运行了此命令。您可以在以 `149:` 开头的行上看到描述此过程正在使用的 BTF 信息的条目：

```
149: name <anon>  size 4372B  prog_ids 319  map_ids 103
        pids hello-buffer-co(7660)
```

这一行告诉我们以下内容：

+   此 BTF 信息块的 ID 是 149。

+   这是一个大约 4 KB 的匿名 BTF 信息块。

+   它被具有 `prog_id 319` 的 BPF 程序和具有 `map_id 103` 的 BPF 映射使用。

+   它还被进程 ID 7660（括号内显示）运行的 `hello-buffer-config` 可执行文件使用（其名称已截断为 15 个字符）。

这些程序、映射和 BTF 标识符与 `bpftool` 显示的有关 `hello-buffer-config` 的名为 `hello` 的程序的输出匹配：

```
bpftool prog show name hello
319: kprobe  name hello  tag a94092da317ac9ba  gpl
        loaded_at 2022-08-28T14:13:35+0000  uid 0
        xlated 400B  jited 428B  memlock 4096B  map_ids 103,104
        btf_id 149
        pids hello-buffer-co(7660)
```

唯一似乎完全不匹配的是程序引用了额外的 `map_id`，`104`。这是性能事件缓冲区映射，并且不使用 BTF 信息；因此，它不会出现在与 BTF 相关的输出中。

就像 `bpftool` 可以转储程序和映射的内容一样，它也可以用来查看数据块中包含的 BTF 类型信息。

## BTF 类型

知道 BTF 信息的 ID 后，您可以使用命令 `bpftool btf dump id <id>` 检查其内容。当我使用之前获取的 ID 149 运行这个命令时，我得到了 69 行输出，每行都是一个类型定义。我将描述前几行，这应该能让您了解如何解释其余部分。这些首几行的 BTF 信息与在源代码中如此定义的 `config` 哈希映射相关：

```
struct user_msg_t {
  char message[12];
};

BPF_HASH(config, u32, struct user_msg_t);
```

此哈希表的键类型为 `u32`，值类型为 `struct user_msg_t`。该结构包含一个 12 字节的 `message` 字段。让我们看看这些类型在对应的 BTF 信息中是如何定义的。

BTF 输出的前三行如下：

```
[1] TYPEDEF 'u32' type_id=2
[2] TYPEDEF '__u32' type_id=3
[3] INT 'unsigned int' size=4 bits_offset=0 nr_bits=32 encoding=(none)
```

每行开头的方括号中的数字是类型 ID（因此第一行，以 `[1]` 开头的行定义了 `type_id 1`，依此类推）。让我们更详细地探讨这三种类型：

+   类型 1 定义了名为 `u32` 的类型及其类型，由以 `[2]` 开头的行定义，即哈希表中键的类型为 `u32`。

+   类型 2 的名称为 `__u32`，类型由 `type_id 3` 定义。

+   类型 3 是一个名为 `unsigned int` 的整数类型，长度为 4 字节。

这三种类型都是指 32 位无符号整数类型的同义词。在 C 中，整数的长度取决于平台，因此 Linux 定义了诸如 `u32` 这样的类型，明确地定义了特定长度的整数。在此机器上，`u32` 对应于无符号整数。引用这些的用户空间代码应该使用前缀带下划线的同义词，如 `__u32`。

BTF 输出的接下来几个类型如下：

```
[4] STRUCT 'user_msg_t' size=12 vlen=1
        'message' type_id=6 bits_offset=0
[5] INT 'char' size=1 bits_offset=0 nr_bits=8 encoding=(none)
[6] ARRAY '(anon)' type_id=5 index_type_id=7 nr_elems=12
[7] INT '__ARRAY_SIZE_TYPE__' size=4 bits_offset=0 nr_bits=32 encoding=(none)
```

这些关联到 `config` 映射中值为 `user_msg_t` 结构的类型：

+   类型 4 是 `user_msg_t` 结构本身，总长度为 12 字节。它包含一个名为 `message` 的字段，由类型 6 定义。`vlen` 字段指示这个定义中有多少个字段。

+   类型 5 名为 `char`，是一个 1 字节的整数——这正是 C 程序员对名为`char`类型的定义期望的内容。

+   类型 6 将`message`字段的类型定义为具有 12 个元素的数组。每个元素的类型为 5（它是一个`char`），并且数组由类型 7 索引。

+   类型 7 是一个 4 字节整数。

带着这些定义，你可以完整地了解`user_msg_t`结构在内存中的布局，如图 5-1 所示。

![一个`user_msg_t`结构占用 12 字节内存](img/lebp_0501.png)

###### 图 5-1\. 一个`user_msg_t`结构占用 12 字节内存

到目前为止，所有的条目都将`bits_offset`设置为`0`，但是下一行输出的结构具有多个字段：

```
[8] STRUCT '____btf_map_config' size=16 vlen=2
        'key' type_id=1 bits_offset=0
        'value' type_id=4 bits_offset=32
```

这是存储在名为`config`的映射中的键值对的结构定义。我没有在源代码中定义这种`____btf_map_config`类型，但它是由 BCC 生成的。键的类型是`u32`，值是`user_msg_t`结构。这对应于您之前看到的类型 1 和类型 4。

关于这个结构的 BTF 信息的另一个重要部分是，`value`字段从结构的起始位置后 32 位开始。这完全是有道理的，因为前 32 位用于保存`key`字段。

###### 注意

在 C 语言中，结构字段会自动对齐到边界，因此不能简单地假设一个字段总是紧跟在前一个字段的后面。例如，考虑这样一个结构：

```
struct something {
    char letter; 
    u64 number;
}
```

在字段称为`letter`之后，在`number`字段之前有 7 字节的未使用内存，以便 64 位数字可以对齐到可以被 8 整除的内存位置。

在某些情况下，可以启用编译器的紧凑排列来避免这些未使用的空间，但通常会导致性能下降，并且——至少在我的经验中——很少这样做。更常见的是，C 程序员会手动设计结构以有效利用空间。

## 带有 BTF 信息的映射

您刚刚看到了与映射关联的 BTF 信息。现在让我们看看在创建映射时，这些 BTF 数据如何传递给内核。

您在第四章中看到，映射是使用`bpf(BPF_MAP_CREATE)`系统调用创建的。这需要一个`bpf_attr`结构作为参数，[在内核中定义](https://oreil.ly/PLrYG)如下（省略了一些细节）：

```
struct { /* anonymous struct used by BPF_MAP_CREATE command */
    `__u32`   `map_type`;             /* one of enum bpf_map_type */
    `__u32`   `key_size`;             /* size of key in bytes */
    `__u32`   `value_size`;           /* size of value in bytes */
    `__u32`   `max_entries`;          /* max number of entries in a map */
    ...
    char    `map_name`[`BPF_OBJ_NAME_LEN`];
    ...
    `__u32`   `btf_fd`;               /* fd pointing to a BTF type data */
    `__u32`   `btf_key_type_id`;      /* BTF type_id of the key */
    `__u32`   `btf_value_type_id`;    /* BTF type_id of the value */
    ...
};
```

在引入 BTF 之前，`btf_*`字段不存在于`bpf_attr`结构中，内核不了解键或值的结构。`key_size`和`value_size`字段定义了它们所需的内存量，但它们只是被视为一些字节。通过额外传入定义键和值类型的 BTF 信息，内核可以内省它们，像`bpftool`这样的工具可以检索用于漂亮打印的类型信息，正如前面讨论的那样。但是有趣的是，为键和值分别传入了单独的 BTF `type _id`。刚才看到的`____btf_map_config`结构并不被内核用于映射定义；它只是由用户空间的 BCC 使用。

## 函数和函数原型的 BTF 数据

到目前为止，在这个示例输出中，BTF 数据与数据类型有关，但 BTF 数据还包含有关函数和函数原型的信息。以下是描述`hello`函数的同一 BTF 数据块中的信息：

```
[31] FUNC_PROTO '(anon)' ret_type_id=23 vlen=1
        'ctx' type_id=10
[32] FUNC 'hello' type_id=31 linkage=static
```

在类型 32 中，您可以看到名为`hello`的函数被定义为具有前一行中定义的类型。这是一个*函数原型*，它返回类型 ID `23`，并采用单个参数(`vlen=1`)称为`ctx`，其类型 ID 为`10`。为了完整起见，这里是前面输出中那些类型的定义：

```
[10] PTR '(anon)' type_id=0

[23] INT 'int' size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
```

类型 10 是一个匿名指针，其默认类型为`0`，在 BTF 输出中没有明确包含，但定义为 void 指针。^(4)

返回值类型为 23，是一个 4 字节整数，`encoding=SIGNED`表示它是一个有符号整数；也就是说，它可以是正数或负数。这对应于源代码中*hello-buffer-config.py*中的函数定义，如下所示：

```
int hello(void *ctx)
```

到目前为止，我展示的示例 BTF 信息来自于列出 BTF 数据块内容。让我们看看如何获取与特定映射或程序相关的 BTF 信息。

## 检查映射和程序的 BTF 数据

如果您想检查与特定映射相关的 BTF 类型，`bpftool`使这变得容易。例如，这是`config`映射的输出：

```
bpftool btf dump map name config
[1] TYPEDEF 'u32' type_id=2
[4] STRUCT 'user_msg_t' size=12 vlen=1
        'message' type_id=6 bits_offset=0
```

类似地，您可以使用`bpftool btf dump prog <prog identity>`检查与特定程序相关的 BTF 信息。我会让您查看[manpage](https://oreil.ly/lCoV5)以获取更多详细信息。

###### 注意

如果您想更好地理解如何生成和去重 BTF 类型数据，请参阅 Andrii Nakryiko 的另一篇[优秀博客文章](https://oreil.ly/0-a9g)。

到此为止，您应该已经了解了 BTF 如何描述数据结构和函数的格式。一个用 C 编写的 eBPF 程序需要定义类型和结构的头文件。让我们看看为 eBPF 程序可能需要的任何内核数据类型生成头文件是多么简单。

# 生成内核头文件

如果您在启用了 BTF 的内核上运行`bpftool btf list`，您将看到许多类似以下的预存在 BTF 数据块：

```
$ bpftool btf list
1: name [vmlinux]  size 5842973B
2: name [aes_ce_cipher]  size 407B
3: name [cryptd]  size 3372B
...
```

此列表中的第一项，ID 为 1，名称为`vmlinux`，是关于所有数据类型、结构和函数定义的 BTF 信息，这些定义由运行在此（虚拟）机器上的内核使用。^(5)

一个 eBPF 程序需要任何它将引用的内核数据结构和类型的定义。在 CO-RE 出现之前，您通常需要弄清楚 Linux 内核源代码中的许多单独头文件中哪些包含您感兴趣的结构的定义，但现在有了一个更简单的方法，因为启用 BTF 的工具可以从内核中包含的 BTF 信息生成一个适当的头文件。

这个头文件通常称为*vmlinux.h*，您可以像这样使用`bpftool`生成它：

```
bpftool btf dump file /sys/kernel/btf/vmlinux format c > vmlinux.h
```

此文件定义了所有内核的数据类型，因此，在您的 eBPF 程序源代码中包含此生成的*vmlinux.h*文件将提供您可能需要的任何 Linux 数据结构的定义。当您将源代码编译为 eBPF 对象文件时，该对象将包含与此头文件中使用的定义匹配的 BTF 信息。稍后，在目标机器上运行程序时，将加载它到内核中的用户空间程序将调整以解决此构建时 BTF 信息与运行在目标机器上的内核的 BTF 信息之间的差异。

自 Linux 内核版本 5.4 以来，以*/sys/kernel/btf/vmlinux*文件形式的 BTF 信息已被包含在 Linux 内核中。^(6)但是，libbpf 可以利用的原始 BTF 数据也可以为旧内核生成。换句话说，如果您希望在目标机器上运行支持 CO-RE 的 eBPF 程序，而该目标机器没有 BTF 信息，您可能可以自己提供该目标机器的 BTF 数据。关于如何生成 BTF 文件以及各种 Linux 发行版的文件存档，请访问[BTFHub](https://oreil.ly/mPSO0)获取更多信息。

###### 注意

BTFHub 仓库还包括有关[BTF internals](https://oreil.ly/CfyQh)的进一步阅读，如果您希望深入了解此主题。

接下来，让我们看看如何使用这些策略以及其他策略来编写可通过 CO-RE 在各种内核间移植的 eBPF 程序。

# CO-RE eBPF 程序

您将回忆起 eBPF 程序在内核中运行。本章稍后将展示一些与内核中运行代码进行交互的用户空间代码，但本节集中在内核端。

正如你已经看到的那样，eBPF 程序被编译成 eBPF 字节码，（至少在撰写本文时）支持此功能的编译器有 Clang 或 gcc 用于编译 C 代码，以及 Rust 编译器。在第十章中，我将讨论一些使用 Rust 的选项，但在本章的目的上，我将假设你是在 C 中编写并使用 Clang，以及*libbpf*库。

在本章的其余部分，让我们考虑一个名为*hello-buffer-config*的示例应用程序。它与前一章中使用 BCC 框架的*hello-buffer-config.py*示例非常相似，但此版本是用 C 编写的，以使用*libbpf*和 CO-RE。

如果你有基于 BCC 的 eBPF 代码想要迁移到*libbpf*，请查看 Andrii Nakryiko 在他的网站上提供的出色且全面的[指南](https://oreil.ly/iWDcv)。BCC 提供了一些便捷的快捷方式，而使用*libbpf*并不完全相同；反之，*libbpf*提供了一套宏和库函数，使 eBPF 程序员的生活更加轻松。当我讲解示例时，我将指出 BCC 和*libbpf*方法之间的一些区别。

###### 注意

你可以在[*github.com/lizrice/learning-ebpf*](https://github.com/lizrice/learning-ebpf) repo 的*chapter5*目录中找到本节的示例 C eBPF 程序。

首先让我们看看*hello-buffer-config.bpf.c*，它实现了在内核中运行的 eBPF 程序。本章后面我会展示用户空间代码*hello-buffer-config.c*，它加载程序并显示输出，类似于 Python 代码在第四章中 BCC 实现的例子。

就像任何 C 程序一样，eBPF 程序也需要包含一些头文件。

## 头文件

*hello-buffer-config.bpf.c*的前几行指定了它所需要的头文件：

```
#include "vmlinux.h"
#include <bpf/bpf_helpers.h>
#include <bpf/bpf_tracing.h>
#include <bpf/bpf_core_read.h>
#include "hello-buffer-config.h"
```

这些五个文件是*vmlinux.h*文件，来自*libbpf*的几个头文件，以及我自己编写的一个应用程序特定的头文件。让我们看看为*libbpf*程序所需的头文件为什么是一个典型模式。

### 内核头信息

如果你编写的 eBPF 程序涉及任何内核数据结构或类型，最简单的选择是在本章前面描述的*vmliux.h*文件中包含它。或者，可以从 Linux 源中包含单独的头文件，或者如果你真的愿意的话，可以在自己的代码中手动定义类型。如果你将使用*libbpf*中的任何 BPF 助手函数，你需要包含*vmlinux.h*或*linux/types.h*以获取 BPF 助手源引用的`u32`、`u64`等类型的定义。

*vmlinux.h*文件源自内核源码头文件，但不包括来自它们的`#define`值。例如，如果你的 eBPF 程序解析以太网数据包，你可能需要常量定义来确定数据包的协议（比如`0x0800`表示 IP 数据包，或者`0x0806`表示 ARP 数据包）。有一系列常量值需要在你自己的代码中复制，如果你没有包含定义这些值的[*if_ether.h*文件](https://oreil.ly/hoZzP)。我在*hello-buffer-config*中不需要任何这些值定义，但在第八章中你会看到另一个例子，这里是相关的。

### 来自 libbpf 的头文件

要在你的 eBPF 代码中使用任何 BPF 辅助函数，你需要包含*libbpf*提供的头文件，这些头文件给出了它们的定义。

###### 注意

*libbpf*可能会让人稍感困惑的一点是，它不仅仅是一个用户空间库。你会发现自己在用户空间和 eBPF C 代码中都包含*libbpf*的头文件。

在撰写本文时，看到将*libbpf*作为子模块包含并从源代码构建/安装是很常见的——这是我在本书示例库中所做的。如果你将其作为子模块包含，你只需从*libbpf/src*目录运行`make install`即可。我认为不久之后，*libbpf*将更普遍地作为常见 Linux 发行版上的一个包提供，特别是因为*libbpf*现在已经发布了 1.0 版本的里程碑。

### 特定于应用程序的头文件

拥有一个特定于应用程序的头文件是非常常见的，该头文件定义了用户空间和 eBPF 应用程序部分都使用的任何结构。在我的示例中，*hello-buffer-config.h*头文件定义了我用来从 eBPF 程序传递事件数据到用户空间的`data_t`结构。它几乎与这段代码的 BCC 版本中看到的结构相同，如下所示：

```
struct data_t {
  int pid;
  int uid;
  char command[16];
  char message[12];
  char path[16];
};
```

与之前版本唯一的区别是我添加了一个名为`path`的字段。

将这个结构定义拉入一个单独的头文件的原因是，我将在*hello-buffer-config.c*用户空间代码中引用它。在 BCC 版本中，内核和用户空间代码都定义在一个文件中，BCC 在幕后做了一些工作，使得这个结构对 Python 用户空间代码可用。

## 定义映射

