# 第五章 CO-RE、BTF 和 Libbpf

在上一章中，您第一次遇到了 BTF（BPF 类型格式）。本章讨论了它存在的原因以及它如何用于使 eBPF 程序在不同版本的内核之间可移植。这是 BPF“编译一次，到处运行”（CO-RE）方法的关键部分，它解决了使 eBPF 程序在不同内核版本之间可移植的问题。

许多 eBPF 程序访问内核数据结构，eBPF 程序员需要包含相关的 Linux 头文件，以便他们的 eBPF 代码可以正确地定位这些数据结构中的字段。然而，Linux 内核正在不断发展，这意味着在不同的内核版本之间内部数据结构可能会发生变化。如果您将在一台机器上编译的 eBPF 对象文件¹加载到具有不同内核版本的机器上，就无法保证数据结构会相同。

CO-RE 方法在以高效的方式解决这个可移植性问题方面迈出了重要的一步。它允许 eBPF 程序包含有关它们编译时使用的数据结构布局的信息，并提供了一种机制，用于在目标机器上运行时调整字段的访问方式，如果数据结构布局在目标机器上是不同的。只要程序不想访问目标机器内核中根本不存在的字段或数据结构，程序就可以在不同的内核版本之间进行移植。

但在我们深入讨论 CO-RE 的工作原理之前，让我们通过查看 BCC 项目最初实施的内核可移植性的先前方法，来讨论为什么它是如此令人向往的。

# BCC 的可移植性方法

在第二章中，我使用[BCC](https://oreil.ly/ReUtn)展示了一个基本的“Hello World”eBPF 程序示例。BCC 项目是第一个流行的实现 eBPF 程序的项目，为具有较少内核经验的程序员提供了相对易于访问的用户空间和内核方面的框架。为了解决跨内核的可移植性问题，BCC 采取了在目标机器上即时编译 eBPF 代码的方法。这种方法存在一些问题：

+   编译工具链需要安装在您希望代码运行的每台目标机器上，以及内核头文件（这并不总是默认存在的）。

+   在工具启动之前，您必须等待编译完成，这可能意味着每次启动工具都会有几秒钟的延迟。

+   如果您在大量相同的机器上运行工具，那么在每台机器上重复编译是一种计算资源的浪费。

+   一些基于 BCC 的项目将它们的 eBPF 源代码和工具链打包到一个容器映像中，这样可以更容易地将其分发到每台机器上。但这并不能解决确保内核头文件存在的问题，甚至可能意味着更多的重复，如果这些 BCC 容器中的几个安装在每台机器上。

+   嵌入式设备可能没有足够的内存资源来运行编译步骤。

由于这些问题，如果您计划着手开发一个重要的新的 eBPF 项目，我不建议使用这种传统的 BCC 方法，特别是如果您计划将其分发给其他人使用。在本书中，我给出了一些基于 BCC 的例子，因为它是学习 eBPF 基本概念的一个很好的方法，特别是因为 Python 用户空间代码如此紧凑且易于阅读。如果您更喜欢它并且想快速地组合一些东西，那么它也是一个完全不错的选择。但对于严肃的现代 eBPF 开发来说，这并不是最佳的方法。

CO-RE 方法为 eBPF 程序的跨内核可移植性问题提供了一个更好的解决方案。

###### 注意

[*github.com/iovisor/bcc*](https://oreil.ly/ReUtn)上的 BCC 项目包括一系列用于观察 Linux 机器行为的命令行工具。位于[*tools*](https://oreil.ly/fI4w_)目录中的原始版本大多使用 Python 实现，使用了我在本节中描述的传统可移植性方法。

在 BCC 的[*libbpf-tools*](https://oreil.ly/ke7yq)目录中，您将找到用 C 编写的这些工具的更新版本，它们利用了*libbpf*和 CO-RE，并且不会遇到我刚列出的问题。它们是一组非常有用的实用程序！

# CO-RE 概述

CO-RE 方法包括几个元素：²^,³

BTF

[BTF](https://oreil.ly/iRCuI)是一种用于表达数据结构和函数签名布局的格式。在 CO-RE 中，它用于确定编译时和运行时结构之间的任何差异。BTF 也被`bpftool`等工具用于以人类可读的格式转储数据结构。从 5.4 版本开始的 Linux 内核支持 BTF。

内核头文件

Linux 内核源代码包括描述其使用的数据结构的头文件，这些头文件在不同版本的 Linux 之间可能会发生变化。eBPF 程序员可以选择包含单个头文件，或者，正如您将在本章中看到的，您可以使用`bpftool`从运行中的系统生成一个名为*vmlinux.h*的头文件，其中包含 BPF 程序可能需要的有关内核的所有数据结构信息。

编译器支持

[Clang 编译器进行了增强](https://oreil.ly/6xFJm)，以便在使用`-g`标志编译 eBPF 程序时，包含所谓的*CO-RE 重定位*，这些重定位来自描述内核数据结构的 BTF 信息。GCC 编译器在[12 版本](https://oreil.ly/_6PEE)中还为 BPF 目标添加了 CO-RE 支持。

数据结构重定位的库支持

在用户空间程序加载 eBPF 程序到内核时，CO-RE 方法要求调整字节码以补偿编译时存在的数据结构与即将运行的目标机器上的数据结构之间的任何差异，这是基于编译到对象中的 CO-RE 重定位信息。有几个库可以处理这个问题：[*libbpf*](https://oreil.ly/E742u)是最初包含此重定位功能的 C 库，Cilium eBPF 库为 Go 程序员提供了相同的功能，Aya 则为 Rust 提供了这个功能。

可选地，BPF 骨架

骨架可以从编译的 BPF 对象文件中自动生成，其中包含方便的函数，用户空间代码可以调用这些函数来管理 BPF 程序的生命周期——将它们加载到内核中，将它们附加到事件等等。如果您用 C 编写用户空间代码，可以使用`bpftool gen skeleton`生成骨架。这些函数是更高级的抽象，对于开发人员来说可能比直接使用底层库（*libbpf*、*cilium/ebpf*等）更方便。

###### 注意

Andrii Nakryiko 写了一篇[优秀的博客文章](https://oreil.ly/aeQJo)，描述了 CO-RE 的背景，以及它的工作原理和如何使用它。他还写了权威的[BPF CO-RE 参考指南](https://oreil.ly/lbW_T)，所以如果您要开始编写代码，请务必阅读。他的[*libbpf-bootstrap*指南](https://oreil.ly/_jet-)介绍了如何使用 CO-RE + *libbpf* +骨架从头开始构建 eBPF 应用程序，也是必读之物。

现在您已经了解了 CO-RE 的元素，让我们深入了解它们的工作原理，从探索 BTF 开始。

# BPF 类型格式

BTF 信息描述了数据结构和代码在内存中的布局。这些信息可以用于各种不同的用途。

## BTF 用例

在 CO-RE 章节中讨论 BTF 的主要原因是，了解 eBPF 程序编译的结构布局与即将运行的结构布局之间的差异，可以在程序加载到内核时进行适当的调整。我将在本章后面讨论重定位过程，但现在，让我们也考虑一下 BTF 信息可以用于的其他一些用途。

了解结构的布局方式以及结构中每个字段的类型，可以使得以人类可读的形式打印结构的内容成为可能。例如，从计算机的角度来看，字符串只是一系列字节，但将这些字节转换为字符使得字符串对人类来说更容易理解。在上一章中，您已经看到了这方面的一个例子，`bpftool`使用 BTF 信息来格式化映射转储的输出。

BTF 信息还包括行和函数信息，使得`bpftool`能够在翻译或 JIT 程序转储的输出中交错源代码，就像您在第三章中看到的那样。当您来到第六章时，您还将看到源代码信息与验证器日志输出交错，这同样来自 BTF 信息。

BTF 信息也是 BPF 自旋锁所必需的。*自旋锁*用于阻止两个 CPU 核同时访问相同的映射值。锁必须是映射值结构的一部分，就像这样：

```cpp
struct my_value {
     ... <other fields>
     struct bpf_spin_lock lock;
... <other fields>
};
```

在内核中，eBPF 程序使用`bpf_spin_lock()`和`bpf_spin_unlock()`辅助函数来获取和释放锁。只有在 BTF 信息可用以描述结构中锁字段的位置时，才能使用这些辅助函数。

###### 注意

自旋锁支持是在内核版本 5.1 中添加的。对自旋锁的使用有很多限制：它们只能用于哈希或数组映射类型，并且不能用于跟踪或套接字过滤类型的 eBPF 程序。在[lwn.net 关于 BPF 并发管理的文章](https://oreil.ly/kAyAU)中了解更多关于自旋锁的信息。

现在您知道 BTF 信息的用途，让我们通过查看一些示例来使其更具体。

## 使用 bpftool 列出 BTF 信息

与程序和映射一样，您可以使用`bpftool`实用程序显示 BTF 信息。以下命令列出了加载到内核中的所有 BTF 数据：

```cpp
bpftool btf list
1: name [vmlinux]  size 5843164B
2: name [aes_ce_cipher]  size 407B
3: name [cryptd]  size 3372B
...
149: name <anon>  size 4372B  prog_ids 319  map_ids 103
        pids hello-buffer-co(7660)
155: name <anon>  size 37100B
        pids bpftool(7784)
```

（出于简洁起见，我省略了许多条目。）

列表中的第一个条目是`vmlinux`，它对应于我之前提到的*vmlinux*文件，该文件保存了有关当前运行内核的 BTF 信息。

###### 注意

本章早期的一些示例重用了第四章中的程序，然后在本章后期，您将找到新的示例，其源代码位于[*github.com/lizrice/learning-ebpf*](https://github.com/lizrice/learning-ebpf)的*chapter5*目录中。

为了获得此示例输出，我在运行第四章中的`hello-buffer-config`示例时运行了此命令。您可以在以`149:`开头的行上看到描述此进程正在使用的 BTF 信息的条目：

```cpp
149: name <anon>  size 4372B  prog_ids 319  map_ids 103
        pids hello-buffer-co(7660)
```

这行告诉我们的是：

+   这个 BTF 信息块的 ID 是 149。

+   这是一个大约 4KB 的 BTF 信息的匿名 blob。

+   它被具有`prog_id 319`的 BPF 程序和具有`map_id 103`的 BPF 映射使用。

+   它还被 ID 为 7660 的进程（括号内显示）使用，运行名为`hello-buffer-config`的可执行文件（其名称已被截断为 15 个字符）。

这些程序、映射和 BTF 标识符与`bpftool`显示的有关`hello-buffer-config`的名为`hello`的程序的输出相匹配：

```cpp
bpftool prog show name hello
319: kprobe  name hello  tag a94092da317ac9ba  gpl
        loaded_at 2022-08-28T14:13:35+0000  uid 0
        xlated 400B  jited 428B  memlock 4096B  map_ids 103,104
        btf_id 149
        pids hello-buffer-co(7660)
```

唯一似乎不完全匹配的是程序引用了额外的`map_id`，`104`。那是性能事件缓冲区映射，它不使用 BTF 信息；因此，它不会出现在与 BTF 相关的输出中。

就像`bpftool`可以转储程序和映射的内容一样，它也可以用来查看包含在数据块中的 BTF 类型信息。

## BTF 类型

知道 BTF 信息的 ID 后，可以使用命令`bpftool btf dump id <id>`来检查其内容。当我使用之前获得的 ID 149 运行时，我得到了 69 行输出，每行都是一个类型定义。我只描述前几行，这应该能让你很好地理解如何解释其余部分。这些前几行的 BTF 信息与在源代码中定义的`config`哈希映射相关：

```cpp
structuser_msg_t{ `char``message``[``12``];` ``};` ``BPF_HASH``(``config``,``u32``,``struct``user_msg_t``);```

```cpp

 ```这个哈希表的键的类型是`u32`，值的类型是`struct user_msg_t`。该结构包含一个 12 字节的`message`字段。让我们看看这些类型在相应的 BTF 信息中是如何定义的。

BTF 输出的前三行如下：

```cpp
[1] TYPEDEF 'u32' type_id=2
[2] TYPEDEF '__u32' type_id=3
[3] INT 'unsigned int' size=4 bits_offset=0 nr_bits=32 encoding=(none)
```

每行开头的方括号中的数字是类型 ID（因此第一行，以`[1]`开头，定义了`type_id 1`，依此类推）。让我们更详细地了解这三种类型：

+   类型 1 定义了一个名为`u32`的类型及其类型，由`type_id 2`定义，即在以`[2]`开头的行中定义的类型。你知道，哈希表中的键具有这种类型`u32`。

+   类型 2 的名称是`__u32`，由`type_id 3`定义的类型。

+   类型 3 是一个名为`unsigned int`的整数类型，长度为 4 字节。

这三种类型都是 32 位无符号整数类型的同义词。在 C 中，整数的长度取决于平台，因此 Linux 定义了像`u32`这样的类型，以明确定义特定长度的整数。在这台机器上，`u32`对应于无符号整数。引用这些的用户空间代码应该使用带下划线前缀的同义词，如`__u32`。

BTF 输出中的接下来几种类型如下：

```cpp
[4] STRUCT 'user_msg_t' size=12 vlen=1
        'message' type_id=6 bits_offset=0
[5] INT 'char' size=1 bits_offset=0 nr_bits=8 encoding=(none)
[6] ARRAY '(anon)' type_id=5 index_type_id=7 nr_elems=12
[7] INT '__ARRAY_SIZE_TYPE__' size=4 bits_offset=0 nr_bits=32 encoding=(none)
```

这些与`config`映射中的值使用的`user_msg_t`结构相关：

+   类型 4 是`user_msg_t`结构本身，总共有 12 个字节长。它包含一个名为`message`的字段，由类型 6 定义。`vlen`字段指示了这个定义中有多少个字段。

+   类型 5 的名称是`char`，是一个 1 字节的整数——这正是 C 程序员对名为“char”的类型所期望的定义。

+   类型 6 将`message`字段定义为一个具有 12 个元素的数组。每个元素的类型为 5（它是一个`char`），并且该数组由类型 7 索引。

+   类型 7 是一个 4 字节的整数。

有了这些定义，你可以完整地了解`user_msg_t`结构在内存中的布局，就像图 5-1 中所示的那样。

![user_msg_t 结构占用 12 字节内存](img/lebp_0501.png)

###### 图 5-1\. `user_msg_t`结构占用 12 字节内存

到目前为止，所有条目的`bits_offset`都设置为`0`，但是输出的下一行有一个具有多个字段的结构：

```cpp
[8] STRUCT '____btf_map_config' size=16 vlen=2
        'key' type_id=1 bits_offset=0
        'value' type_id=4 bits_offset=32
```

这是一个用于存储名为`config`的映射中的键值对的结构定义。我没有在源代码中定义这个`____btf_map_config`类型，但它是由 BCC 生成的。键的类型是`u32`，值是`user_msg_t`结构。这些对应于之前看到的类型 1 和 4。

关于这个结构的 BTF 信息的另一个重要部分是`value`字段在结构开始后 32 位开始。这完全合理，因为前 32 位需要保存`key`字段。

###### 注意

在 C 中，结构字段会自动对齐到边界，因此不能简单地假设一个字段总是直接跟在前一个字段的内存中。例如，考虑这样一个结构：

```cpp
structsomething{ `char``letter``;`
`u64``number``;` ``}``
```

```cppThere would be 7 bytes of unused memory after the field called `letter` before the `number` field so that the 64-bit number can be aligned to a memory location divisible by 8.

It’s possible in some circumstances to turn on compiler packing to avoid this unused space, but it generally results in lower performance and—at least in my experience—it’s unusual to do so. More often, C programmers will design structures by hand to make efficient use of space.``````cpp  ```## 带有 BTF 信息的映射

您刚刚看到了与映射相关的 BTF 信息。现在让我们看看在创建映射时内核如何传递此 BTF 数据。

您在第四章中看到，映射是使用`bpf(BPF_MAP_CREATE)`系统调用创建的。这需要一个`bpf_attr`结构作为参数，[在内核中定义](https://oreil.ly/PLrYG)如下（一些细节被省略）：

```cpp
struct{/* anonymous struct used by BPF_MAP_CREATE command */`__u32``map_type`;/* one of enum bpf_map_type */`__u32``key_size`;/* size of key in bytes */`__u32``value_size`;/* size of value in bytes */`__u32``max_entries`;/* max number of entries in a map */...char`map_name`[`BPF_OBJ_NAME_LEN`];...`__u32``btf_fd`;/* fd pointing to a BTF type data */`__u32``btf_key_type_id`;/* BTF type_id of the key */`__u32``btf_value_type_id`;/* BTF type_id of the value */...};
```

在引入 BTF 之前，`btf_*`字段不存在于`bpf_attr`结构中，内核对键或值的结构一无所知。`key_size`和`value_size`字段定义了它们所需的内存量，但它们只是被视为一些字节。通过另外传递定义键和值类型的 BTF 信息，内核可以内省它们，而像`bpftool`这样的实用程序可以检索类型信息以进行漂亮的打印，如前面讨论的那样。但是，有趣的是要注意为键和值分别传递了单独的 BTF `type _id`。您刚刚看到的`____btf_map_config`结构并未被内核用于映射定义；它只是由用户空间的 BCC 使用。

## 函数和函数原型的 BTF 数据

到目前为止，此示例输出中的 BTF 数据与数据类型有关，但 BTF 数据还包含有关函数和函数原型的信息。以下是描述`hello`函数的相同 BTF 数据块中的信息：

```cpp
[31] FUNC_PROTO '(anon)' ret_type_id=23 vlen=1
        'ctx' type_id=10
[32] FUNC 'hello' type_id=31 linkage=static
```

在类型 32 中，您可以看到名为`hello`的函数被定义为具有前一行中定义的类型。这是一个*函数原型*，它返回类型 ID `23`的值，并带有一个名为`ctx`的单个参数（`vlen=1`），其类型 ID 为`10`。为了完整起见，这里是输出中较早时那些类型的定义：

```cpp
[10] PTR '(anon)' type_id=0

[23] INT 'int' size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
```

类型 10 是一个匿名指针，其默认类型为`0`，在 BTF 输出中没有明确包含，但被定义为 void 指针。⁴

类型 23 的返回值是一个 4 字节整数，`encoding=SIGNED`表示它是一个有符号整数；也就是说，它可以具有正值或负值。这对应于*hello-buffer-config.py*源代码中的函数定义，如下所示：

```cpp
inthello(void*ctx)
```

到目前为止，我展示的示例 BTF 信息来自于列出 BTF 数据块的内容。让我们看看如何仅获取与特定映射或程序相关的 BTF 信息。## 检查映射和程序的 BTF 数据

如果您想检查与特定映射相关的 BTF 类型，`bpftool`可以轻松实现。例如，这是`config`映射的输出：

```cpp
bpftool btf dump map name config
[1] TYPEDEF 'u32' type_id=2
[4] STRUCT 'user_msg_t' size=12 vlen=1
        'message' type_id=6 bits_offset=0
```

同样，您可以使用`bpftool btf dump prog <prog identity>`检查与特定程序相关的 BTF 信息。我会让您查看[manpage](https://oreil.ly/lCoV5)以获取更多详细信息。

###### 注意

如果您想更好地了解 BTF 类型数据是如何生成和去重的，还有另一篇[Andrii Nakryiko 的博客文章](https://oreil.ly/0-a9g)可以参考。

到目前为止，您应该已经了解了 BTF 如何描述数据结构和函数的格式。用 C 编写的 eBPF 程序需要定义类型和结构的头文件。让我们看看为 eBPF 程序可能需要的任何内核数据类型生成头文件有多容易。```cpp`  ```# 生成内核头文件

如果在启用了 BTF 的内核上运行`bpftool btf list`，您将看到许多预先存在的 BTF 数据块，看起来像这样：

```cpp
$ bpftool btf list
1: name [vmlinux]  size 5842973B
2: name [aes_ce_cipher]  size 407B
3: name [cryptd]  size 3372B
...
```

此列表中的第一项，ID 为 1，名称为`vmlinux`，是有关运行在此（虚拟）机器上的内核使用的所有数据类型、结构和函数定义的 BTF 信息。⁵

eBPF 程序需要它将要引用的任何内核数据结构和类型的定义。在 CO-RE 出现之前，您通常需要弄清楚 Linux 内核源代码中的许多个别头文件中哪一个包含了您感兴趣的结构的定义，但现在有了一个更简单的方法，因为启用了 BTF 的工具可以从内核中包含的 BTF 信息生成一个适当的头文件。

这个头文件通常被称为*vmlinux.h*，您可以使用`bpftool`生成它，就像这样：

```cpp
bpftool btf dump file /sys/kernel/btf/vmlinux format c > vmlinux.h
```

这个文件定义了所有内核的数据类型，因此在您的 eBPF 程序源代码中包含这个生成的*vmlinux.h*文件会提供您可能需要的任何 Linux 数据结构的定义。当您将源代码编译成 eBPF 对象文件时，该对象将包含与此头文件中使用的定义相匹配的 BTF 信息。稍后，在目标机器上运行程序时，将加载它到内核中的用户空间程序将对构建时的 BTF 信息和在目标机器上运行的内核的 BTF 信息之间的差异进行调整。

自 Linux 内核 5.4 版本以来，以*/sys/kernel/btf/vmlinux*文件的形式包含的 BTF 信息，⁶，但*libbpf*可以利用的原始 BTF 数据也可以为较旧的内核生成。换句话说，如果您想在目标机器上运行一个启用了 CO-RE 的 eBPF 程序，而该目标机器尚未具有 BTF 信息，您可能可以自己提供该目标的 BTF 数据。有关如何生成 BTF 文件以及各种 Linux 发行版的文件存档的信息，请访问[BTFHub](https://oreil.ly/mPSO0)。

###### 注意

BTFHub 存储库还包括有关[BTF 内部](https://oreil.ly/CfyQh)的进一步阅读，如果您想深入了解这个主题。

接下来，让我们看看如何使用这种和其他策略来编写可在使用 CO-RE 的内核之间移植的 eBPF 程序。

# CO-RE eBPF 程序

您会记得 eBPF 程序在内核中运行。在本章的后面，我将展示一些用户空间代码，这些代码将与内核中运行的代码进行交互，但在本节中，我集中讨论内核方面。

正如您已经看到的，eBPF 程序被编译成 eBPF 字节码，而（至少在撰写本文时）支持此功能的编译器是 Clang 或 gcc 用于编译 C 代码，以及 Rust 编译器。我将在第十章中讨论一些您在使用 Rust 时的选择，但在本章中，我将假设您是用 C 语言编写的，并使用 Clang，以及*libbpf*库。

在本章的其余部分，让我们考虑一个名为*hello-buffer-config*的示例应用程序。它与上一章中使用 BCC 框架的*hello-buffer-config.py*示例非常相似，但这个版本是用 C 语言编写的，以使用*libbpf*和 CO-RE。

如果您有基于 BCC 的 eBPF 代码，想要迁移到*libbpf*，请查看 Andrii Nakryiko 在他的网站上的优秀而全面的[指南](https://oreil.ly/iWDcv)。BCC 提供了一些方便的快捷方式，使用*libbpf*的方式并不完全相同；相反，*libbpf*提供了一套宏和库函数，以使 eBPF 程序员的生活更加轻松。当我演示示例时，我将指出 BCC 和*libbpf*方法之间的一些差异。

###### 注意

您将在[*github.com/lizrice/learning-ebpf*](https://github.com/lizrice/learning-ebpf)存储库的*chapter5*目录中找到本节的示例 C eBPF 程序。

首先让我们看一下*hello-buffer-config.bpf.c*，它实现了在内核中运行的 eBPF 程序。本章后面我将向您展示*hello-buffer-config.c*中的用户空间代码，该代码加载程序并显示输出，就像 Python 代码在第四章中对此示例的 BCC 实现所做的那样。

与任何 C 程序一样，eBPF 程序将需要包含一些头文件。

## 头文件

*hello-buffer-config.bpf.c*的前几行指定了它需要的头文件：

```cpp
#include "vmlinux.h"
#include <bpf/bpf_helpers.h>
#include <bpf/bpf_tracing.h>
#include <bpf/bpf_core_read.h>
#include "hello-buffer-config.h"
```

这五个文件是*vmlinux.h*文件，*libbpf*的一些头文件和我自己编写的特定于应用程序的头文件。让我们看看为*libbpf*程序所需的头文件为什么是典型的模式。

### 内核头信息

如果您正在编写引用任何内核数据结构或类型的 eBPF 程序，最简单的选择是包含本章前面描述的*vmlinux.h*文件。或者，也可以从 Linux 源中包含单个头文件，或者在自己的代码中手动定义类型，如果您真的想要这样做的话。如果要使用*libbpf*中的任何 BPF 辅助函数，您需要包含*vmlinux.h*或*linux/types.h*，以获取 BPF 辅助源引用的`u32`、`u64`等类型的定义。

*vmlinux.h*文件源自内核源头文件，但不包括其中的`#define`值。例如，如果您的 eBPF 程序解析以太网数据包，则可能需要告诉您数据包包含的协议的常量定义（例如`0x0800`表示它是 IP 数据包，或`0x0806`表示 ARP 数据包）。如果您不包括定义这些值的[*if_ether.h*文件](https://oreil.ly/hoZzP)，则需要在自己的代码中复制一系列常量值。对于*hello-buffer-config*，我不需要这些值定义，但您将在第八章中看到另一个示例，其中这是相关的。

### 来自 libbpf 的头文件

要在 eBPF 代码中使用任何 BPF 辅助函数，您需要包含*libbpf*中给出其定义的头文件。

###### 注意

关于*libbpf*可能会让人稍微困惑的一件事是，它不仅仅是一个用户空间库。您将发现自己在用户空间和 eBPF C 代码中都包含*libbpf*的头文件。

在撰写本文时，通常会看到 eBPF 项目将*libbpf*作为子模块包含并从源代码构建/安装-这是我在本书示例存储库中所做的。如果将其包含为子模块，则只需从*libbpf/src*目录运行`make install`。我认为不久之后，*libbpf*将更常见地作为常见 Linux 发行版上的软件包提供，特别是自从*libbpf*现在已经通过了[1.0 版本发布](https://oreil.ly/8BFq6)的里程碑。

### 特定于应用程序的头文件

通常会有一个特定于应用程序的头文件，定义了用户空间和 eBPF 应用程序的共同使用的任何结构。在我的示例中，*hello-buffer-config.h*头文件定义了`data_t`结构，我用它来从 eBPF 程序传递事件数据到用户空间。它几乎与您在此代码的 BCC 版本中看到的结构相同，看起来是这样的：

```cpp
structdata_t{ `int``pid``;` ``int``uid``;` ``char``command``[``16``];` ``char``message``[``12``];` ``char``path``[``16``];` ``};``````cpp
```

```cppThe only difference from the version you saw before is that I have added a field called `path`.

